fonecmid-diplom/src/Documents/ВКМ_ФактическийОтпуск/ВКМ_ФактическийОтпуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ФактическийОтпуск</name>
  <registerRecords>AccumulationRegister.ВКМ_ДниОтпускаСотрудников</registerRecords>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ДниОтпускаСотрудников/ВКМ_ДниОтпускаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ДниОтпускаСотрудников</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчетаОтпуска</name>
    <type>
      <types>EnumRef.ВКМ_ВидыУчетаОтпуска</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВКМ_ВидыУчетаОтпуска/ВКМ_ВидыУчетаОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_ВидыУчетаОтпуска</name>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Факт</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ФактическийОтпуск/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ДниОтпускаСотрудников.Записывать = Истина;
	
	Для Каждого СтрокаОтпуска Из ОтпускаСотрудников Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаОтпуска.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоДней = КоличествоДнейОтпускаПоСтроке(
			СтрокаОтпуска.ДатаНачала,
			СтрокаОтпуска.ДатаОкончания,
			СтрокаОтпуска.КоличествоДней);
		
		Если КоличествоДней <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ГодОтпуска = ?(ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала), Год(СтрокаОтпуска.ДатаНачала), Год(Дата));
		
		Движение = Движения.ВКМ_ДниОтпускаСотрудников.Добавить();
		Движение.Период = ?(ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала), СтрокаОтпуска.ДатаНачала, Дата);
		Движение.Сотрудник = СтрокаОтпуска.Сотрудник;
		Движение.Год = ГодОтпуска;
		Движение.ВидУчетаОтпуска = Перечисления.ВКМ_ВидыУчетаОтпуска.Факт;
		Движение.КоличествоДней = КоличествоДней;
		
	КонецЦикла;
	
КонецПроцедуры

Функция КоличествоДнейОтпускаПоСтроке(ДатаНачала, ДатаОкончания, КоличествоДней)
	
	Если ЗначениеЗаполнено(КоличествоДней) И КоличествоДней > 0 Тогда
		Возврат КоличествоДней;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаНачала) Или Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		Возврат 0;
	КонецЕсли;
	
	КоличествоСекунд = НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала);
	Возврат Цел(КоличествоСекунд / 86400) + 1;
	
КонецФункции
